tests/foass-artillery-api-test.yaml
config:
  target: "http://foass-service.foass.svc.cluster.local:5000"
  phases:
    - duration: 6
      arrivalRate: 5
      name: Warm up
    - duration: 15
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 10
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "Check health endpoint"
    flow:
      - get:
          url: "/health"